static-benchmark-results/vllm_meta-llama-3.1-8b-instruct_isl1000_osl1000_tp2_static/concurrency=32/bench.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f3f012f9620>, trust_remote_code=False, seed=0, num_prompts=96, dataset_name='sharegpt', no_stream=False, dataset_path='/localhome/local-triv/benchmark/datasets/fixed_isl1000.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=1000, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', header=None, max_concurrency=32, model='meta-llama/Meta-Llama-3.1-8B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/localhome/local-triv/benchmark/static-benchmark-results/vllm_meta-llama-3.1-8b-instruct_isl1000_osl1000_tp2_static/concurrency=32', result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-ecf7f667-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 96/96 [01:34<00:00,  1.02it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     96        
Failed requests:                         0         
Maximum request concurrency:             32        
Benchmark duration (s):                  94.53     
Total input tokens:                      96096     
Total generated tokens:                  96000     
Request throughput (req/s):              1.02      
Output token throughput (tok/s):         1015.60   
Peak output token throughput (tok/s):    1760.00   
Peak concurrent requests:                49.00     
Total token throughput (tok/s):          2032.21   
---------------Time to First Token----------------
Mean TTFT (ms):                          3433.21   
Median TTFT (ms):                        3586.67   
P99 TTFT (ms):                           5924.00   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          28.09     
Median TPOT (ms):                        27.93     
P99 TPOT (ms):                           31.93     
---------------Inter-token Latency----------------
Mean ITL (ms):                           28.09     
Median ITL (ms):                         20.60     
P99 ITL (ms):                            111.39    
==================================================